from training.types import TextParamsTraning

class TextStage:
    
    STAGE_TEXT = """
- <b>Тренер</b>: <i>{text_coach}</i>

Варіанти відповідей
1️⃣ - <b>{first_answer_сhoice}</b>

2️⃣ - <b>{second_answer_сhoice}</b>

3️⃣ - <b>{third_answer_сhoice}</b>
"""

    @classmethod
    def get_text(cls, text_params: TextParamsTraning) -> str:
        return cls.STAGE_TEXT.format(
            text_coach           = text_params.text_coach,
            first_answer_сhoice  = text_params.first_answer_сhoice,
            second_answer_сhoice = text_params.second_answer_сhoice,
            third_answer_сhoice  = text_params.third_answer_сhoice
        )
        
        

class TEXT_TRAINING:
    
    START_TRAINING_MESSAGE = """
⚽ <b>Увага! Тренування</b> 🚀  

🏆 <b>Професійний тренер</b> допоможе прокачати навички, підвищити витривалість і покращити контроль м'яча. 
Чи готовий ти вивести свою гру на новий рівень?  

🕒 <b>Час тренування:</b> сьогодні у <u>{time_start}</u> ⏳  

📌 <b>Умови участі:</b>  
✅ <b>Лише 50 місць</b> – хто встиг, той тренується! 🎟️  
✅ <b>Реєстрація відкриється за 15 хвилин до початку.</b>  
✅ <b>VIP-гравці заходять без черги!</b> ⚡  

⚠ <i>Не пропусти шанс! Тренуйся, щоб стати легендою футболу!</i> ⚽🔥
"""

    REGISTER_IN_TRAINING_MESSAGE = """
🚀 <b>Реєстрація на тренування</b>
"""

    SUCCES_END_TRAINING = """
⚽ <b>Тренування завершено!</b> ⏳

Ти виклався на повну і показав свою майстерність на полі! 🔥
За цю тренувальну сесію ти отримуєш <b>+{count_stat}</b> до {name_stat} 💪

Готуйся до наступного тренування! 🏆
"""
    
    FAILED_END_TRAINING = """
⚽ <b>Тренування завершено!</b> ⏳

Ти дуже старався, але цього разу тренування було складним... 😓
На жаль, ти не зміг успішно його виконати, і цього разу не отримуєш бонусу. ❌

Не засмучуйся! Продовжуй тренуватися, і наступного разу тобі точно вдасться! 💪🔥        
"""

    TRAINING_STATS_SELECTION = """
📊 <b>Оберіть характеристику для прокачування:</b> ⚽🔥

🎯 <b>Техніка</b> – покращує контроль м'яча та дриблінг.  
🥋 <b>Удари</b> – підвищує точність і силу ударів.  
🛡️ <b>Відбір м’яча</b> – допомагає ефективніше перехоплювати м'яч.  
⚡ <b>Швидкість</b> – дає змогу швидше пересуватися полем.  
🏃 <b>Витривалість</b> – дозволяє довше зберігати енергію під час гри.  

🔽 <i>Обери навичку, яку хочеш прокачати, натиснувши на кнопку нижче:</i>
"""


    TRAINING_RE_INVITE = """
🔥 <b>Справжні чемпіони тренуються без зупинки!</b> ⚽🏆  

🔑 <b>У тебе є {count_key} ключів</b>, а для участі у тренуванні потрібен лише <b>1 ключ</b>.  

Не втрачай можливість стати швидшим, сильнішим і майстернішим! 🚀  
▶️ Приєднуйся до наступного тренування прямо зараз!  
"""