from .club_in_match import ClubsInMatch
from database.models.character import Character

from loader import bot, logger
from constants import FIGHT_MENU

from utils.rate_limitter import rate_limiter

import random

goal_conceded = [
    "Воротар невдало відбив м'яч після удару суперника, і на добиванні нападник суперника першим опинився біля м'яча, забивши гол з близької відстані.",
    "Захисники помилилися в передачі, і нападник суперника перехопив м'яч, вийшов один на один з воротарем і відправив м'яч у сітку воріт.",
    "Після подачі з кутового нападник суперника виграв боротьбу у повітрі і головою переправив м'яч у ворота, воротар не встиг зреагувати.",
    "Півзахисник суперника пробив здалеку, і м'яч, рикошетом від захисника, змінив траєкторію, обманувши воротаря та залетівши у кут воріт.",
    "Воротар відбив пенальті, але суперник першим опинився біля м'яча і добив його в сітку.",
    "Команда суперника провела швидку контратаку, і нападник, отримавши передачу, обіграв захисників та воротаря, забивши м'яч у порожні ворота.",
    "Захисник невдало відбив м'яч після прострілу з флангу, і нападник суперника замкнув передачу точним ударом.",
    "Після подачі з кутового м'яч відскочив до нападника, який пробив точно у дальній кут.",
    "Нападник суперника отримав довгу передачу і вийшов сам на сам з воротарем, легко обігравши його.",
    "Півзахисник суперника пробив штрафний удар, і м'яч залетів точно у дев'ятку, воротар не зміг дотягнутися.",
    "Після серії передач на підступах до штрафного майданчика нападник суперника потужно пробив під перекладину.",
    "Воротар невдало вийшов на перехоплення після навісу, і захисник суперника головою відправив м'яч у сітку.",
    "Команда суперника розіграла швидку комбінацію, і нападник забив у порожні ворота після точного пасу партнера.",
    "Захисник спробував вибити м'яч, але влучив у свого партнера, і м'яч відскочив до нападника, який легко забив.",
    "Нападник суперника обіграв кількох захисників і з близької відстані пробив повз воротаря.",
    "Після рикошету м'яч опинився у штрафному майданчику, де нападник суперника першим встиг на удар.",
    "Воротар намагався вибити м'яч, але помилився, і нападник суперника перехопив м'яч, забивши у порожні ворота.",
    "Команда суперника виконала швидку атаку через центр, і нападник пробив точно в нижній кут.",
    "Після навісу з флангу м'яч відскочив до гравця суперника, який пробив у дотик, залишивши воротаря без шансів.",
    "Захисник порушив правила у штрафному майданчику, і нападник суперника впевнено реалізував пенальті."
]

no_goal = [
    "Нападник проривається по флангу, але захисник блокує його простріл, і м'яч виносять за межі штрафного майданчика.",
    "Обидві команди активно пресингують, м'яч постійно переходить з однієї сторони поля на іншу, але жоден із ударів не доходить до воріт.",
    "Після серії кутових захисники кілька разів вибивають м'яч з лінії воріт, не даючи супернику можливості пробити по воротах.",
    "Півзахисники в центрі поля ведуть запеклу боротьбу за м'яч, постійно відбираючи його один у одного, але жодна команда не може створити небезпечний момент.",
    "Нападник виходить на ударну позицію, але в останній момент захисник суперника підкатом вибиває м'яч з-під ніг.",
    "Воротар вибігає назустріч нападнику і блокує його удар в один дотик, врятувавши свою команду від голу.",
    "Після серії швидких атак захисники організовано відпрацьовують на підборах, не дозволяючи супернику завдати вирішального удару.",
    "Нападник суперника виходить на фланг, обігрує одного захисника, але інший блокує його спробу прострілу в штрафний майданчик.",
    "Півзахисник намагається пробити з-за меж штрафного, але м'яч влучає у стінку захисників.",
    "Нападник вийшов на ударну позицію, але захисник чудово відпрацював у підкаті, не давши йому можливості пробити.",
    "Після розіграшу кутового м'яч відскакує до захисників, які відразу ж виносять його подалі від воріт.",
    "Нападник суперника пробиває по воротах з близької відстані, але воротар парирує удар ногами.",
    "Півзахисник пробиває здалеку, але м'яч проходить вище воріт.",
    "Після навісу у штрафний майданчик воротар кулаками вибиває м'яч подалі від воріт.",
    "Команда намагається вивести нападника на ударну позицію, але захисник суперника в останній момент блокує передачу.",
    "Воротар упевнено ловить м'яч після подачі суперника зі штрафного.",
    "Півзахисник суперника проривається до воріт, але в останню мить захисник вибиває м'яч в підкаті.",
    "Після серії передач нападник виходить на удар, але влучає в захисника, який встиг поставити ногу під удар.",
    "Команди борються за контроль м'яча в центрі поля, не дозволяючи одна одній вийти на ударну позицію.",
    "Після швидкої атаки команда заробляє кутовий, але подача не доходить до нападників, і м'яч відлітає за межі поля."
]


goal_scored = [
    "Нападник отримав точний пас у штрафному майданчику, обіграв воротаря і спокійно відправив м'яч у порожні ворота.",
    "Після кутового захисник команди виграв боротьбу в повітрі та головою переправив м'яч у ворота суперника.",
    "Півзахисник пробив здалеку, і м'яч, минувши руки воротаря, залетів прямо в дев'ятку.",
    "Команда провела швидку контратаку, і нападник, отримавши пас від партнера, в один дотик пробив повз воротаря.",
    "Нападник відгукнувся на простріл з флангу і в дотик переправив м'яч у ворота.",
    "Гравець команди реалізував пенальті, точно пробивши у нижній кут воріт.",
    "Півзахисник обіграв кількох суперників і з-за меж штрафного майданчика пробив точно під перекладину.",
    "Після довгої комбінації нападник отримав пас у штрафному майданчику і з близької відстані пробив точно у ворота.",
    "Захисник підключився до атаки і після подачі з флангу точно пробив головою у кут воріт.",
    "Нападник реалізував вихід один на один з воротарем, пробивши точно у дальній кут.",
    "Півзахисник пробив здалеку, і м'яч пролетів повз кількох захисників та воротаря, опинившись у воротах.",
    "Нападник скористався помилкою захисників, які не змогли винести м'яч, і потужно пробив під перекладину.",
    "Після розіграшу штрафного нападник в один дотик відправив м'яч у ворота.",
    "Після серії рикошетів м'яч опинився у нападника, який пробив точно в нижній кут воріт.",
    "Команда провела швидку атаку через центр, і нападник завершив її точним ударом у кут.",
    "Півзахисник отримав м'яч на підступах до штрафного майданчика і пробив точно у кут воріт.",
    "Після довгої комбінації півзахисник віддав пас у штрафний майданчик, і нападник в один дотик забив гол.",
    "Після серії ударів по воротах нападник нарешті зумів пробити повз захисників та воротаря, забивши вирішальний гол.",
    "Команда організувала швидку атаку, і нападник забив у порожні ворота після точного пасу партнера.",
    "Захисник виграв боротьбу в повітрі після кутового і головою відправив м'яч точно у ворота суперника."
]


class ClubMatchSender:
    TEMPLATE_FIGHT = """
⚽️ Починається епічний матч між командами <b>{name_first_club}</b> та <b>{name_second_club}</b>! 

📊 Поточний рахунок: <b>{goals_first_club}</b> - <b>{goals_second_club}</b>.

💪 Загальна сила команд:
- <b>{name_first_club}</b>: <b>{power_first_club:.2f}</b> 
- <b>{name_second_club}</b>: <b>{power_second_club:.2f}</b>

Нехай переможе найсильніший! 🏆
    """

    TEMPLATE_END = """
🎉 Матч між командами <b>{name_first_club}</b> та <b>{name_second_club}</b> завершена! 

📊 Кінцевий рахунок: <b>{goals_first_club}</b> - <b>{goals_second_club}</b>.

{winner_section}

🏆 Дякуємо обом командам за чудову гру! Ви продемонстрували справжній дух суперництва та спортивності.

До нових зустрічей на футбольному полі! ⚽️
    """
    
    TEMPLATE_NOT_CHARACTERS = """
На жаль, ніхто з учасників не з'явився на цей матч. 😔
    """

    TEMPLATE_SEND_REWARD_CHARACTER = """
🎉 За цей матч між командами '{name_first_club}' і '{name_second_club}' ви отримали:
✨ {exp_points} досвіду
💰 {coins} монет
    """


    def __init__(self, clubs_in_match: ClubsInMatch):
        self.clubs_in_match = clubs_in_match


    def _format_message(self, template: str, extra_context: dict = None) -> str:
        context = {
            'name_first_club': self.clubs_in_match.first_club.name_club,
            'name_second_club': self.clubs_in_match.second_club.name_club,
            'goals_first_club': self.clubs_in_match.goals_first_club,
            'goals_second_club': self.clubs_in_match.goals_second_club,
            'power_first_club': self.clubs_in_match.first_club_power ,
            'power_second_club': self.clubs_in_match.second_club_power,
        }
        if extra_context:
            context.update(extra_context)
        return template.format(**context)

    def get_text_fight(self) -> str:
        return self._format_message(self.TEMPLATE_FIGHT)
    
    def get_text_send_reward(self, exp_points: int, coins:int) -> str:
        return self._format_message(template=self.TEMPLATE_SEND_REWARD_CHARACTER, 
                                    extra_context={"exp_points":exp_points,"coins":coins})

    def get_text_winners(self) -> str:
        if self.clubs_in_match.goals_first_club == self.clubs_in_match.goals_second_club:
            winner_section = "🎉 Матч завершився внічию!"
        else:
            winner, loser = self._determine_winner_loser()
            winner_section = f"""
🥇 Переможець: <b>{winner['club_name']}</b> з рахунком <b>{winner['goals']}</b>! 
🥈 Друге місце: <b>{loser['club_name']}</b> з рахунком <b>{loser['goals']}</b>.
            """
        return self._format_message(self.TEMPLATE_END, {'winner_section': winner_section})


    def get_text_goal_evenet(self, goal_event: str) -> str:
        current_score = (
            f"📊 Поточний рахунок: "
            f"<b>{self.clubs_in_match.first_club.name_club}</b> {self.clubs_in_match.goals_first_club} - "
            f"{self.clubs_in_match.goals_second_club} <b>{self.clubs_in_match.second_club.name_club}</b>"
        )

        if goal_event == "goal":
            message = random.choice(goal_scored)
            current_score += f"\n\n💪🏻 Гол забив: {self.clubs_in_match.how_to_increment_goal.name}"
            
        elif goal_event == "no_goal":
            message = random.choice(no_goal)
        else:
            message = random.choice(goal_conceded)
            current_score += f"\n\n💪🏻 Гол забив: {self.clubs_in_match.how_to_increment_goal.name}"

        return f"{message}\n\n{current_score}"


    def _determine_winner_loser(self) -> tuple[dict, dict]:
        if self.clubs_in_match.goals_first_club > self.clubs_in_match.goals_second_club:
            return (
                {'club_name': self.clubs_in_match.first_club.name_club, 'goals': self.clubs_in_match.goals_first_club},
                {'club_name': self.clubs_in_match.second_club.name_club, 'goals': self.clubs_in_match.goals_second_club}
            )
        else:
            return (
                {'club_name': self.clubs_in_match.second_club.name_club, 'goals': self.clubs_in_match.goals_second_club},
                {'club_name': self.clubs_in_match.first_club.name_club, 'goals': self.clubs_in_match.goals_first_club}
            )

    async def send_messages_to_users(self, text: str, characters: list[Character], send_photo: bool = True) -> dict[int, int]:
        for character in characters:
            if character.is_bot:
                continue
            await self._send_message_to_character(character, text, send_photo)

    @rate_limiter
    async def _send_message_to_character(self, character: Character, text: str, send_photo: bool = True) -> None:
        if not character.is_bot:
            try:
                if send_photo:
                    await bot.send_photo(
                        chat_id=character.characters_user_id,
                        photo=FIGHT_MENU,
                        caption=text
                    )
                else:
                    await bot.send_message(
                        chat_id=character.characters_user_id,
                        text=text
                    )
            except Exception as E:
                logger.error(f"Failed to send message to {character.owner.user_name}\nError: {E}")
