[
    {
        "text_stage": "Оцінка результатів тренування",
        "text_coach": "Чудова робота! Ось твої підсумкові бали за тренування. Ти впорався чудово!",
        "variable_answers": [
            "Дякую, тренере! Я зроблю ще краще наступного разу!",
            "Могло бути і краще, але я задоволений результатом.",
            "Я очікував більше. Потрібно ще працювати."
        ]
    },
    {
        "text_stage": "Робота над помилками",
        "text_coach": "Були певні моменти, де ти не зовсім правильно позиціонувався. Тобі потрібно більше працювати над цим.",
        "variable_answers": [
            "Зрозуміло, тренере. Я обов'язково попрацюю над цим!",
            "Я знаю, що ще є до чого прагнути.",
            "Ніби все було нормально, чому саме ця помилка?"
        ]
    },
    {
        "text_stage": "Хвалебна оцінка",
        "text_coach": "Ти чудово працював у тактичних вправах. Я бачив, як ти швидко реагуєш на ситуацію!",
        "variable_answers": [
            "Дякую! Я дуже старався!",
            "Радий, що це помітив тренер. Продовжую працювати!",
            "Тренер, я відчуваю, що ще є куди рости."
        ]
    },
    {
        "text_stage": "Аналіз успіхів",
        "text_coach": "Ти продемонстрував хорошу техніку у передачах. Тепер твоє завдання — удосконалити удари.",
        "variable_answers": [
            "Зрозуміло, тренере! Я буду більше тренувати удари!",
            "Так, удари ще не зовсім вийшли, але я працюватиму над цим.",
            "Я більше зосереджуюсь на передачах, але прийму до уваги."
        ]
    },
    {
        "text_stage": "Мотивація на наступне тренування",
        "text_coach": "Ти на правильному шляху, але нам ще багато чого треба досягти. Не зупиняйся!",
        "variable_answers": [
            "Обіцяю, тренере, я продовжу старанно працювати!",
            "Мені ще є до чого прагнути, але я вірю, що досягну результату.",
            "Не знаю, чи вийде, але я буду пробувати."
        ]
    },
    {
        "text_stage": "Розбір помилок після КТЕ",
        "text_coach": "Ти інколи запізнювався з реакцією на дії суперника. В наступний раз потрібно бути швидшим!",
        "variable_answers": [
            "Я працюватиму над швидкістю реакції!",
            "Зрозуміло, наступного разу буду швидше.",
            "Я вважав, що зробив усе правильно. Можливо, це було через втому."
        ]
    },
    {
        "text_stage": "Поради від тренера",
        "text_coach": "Ти добре працював, але наступного разу спробуй менше думати, більше діяти.",
        "variable_answers": [
            "Я зрозумів, тренере. Буду працювати над швидкими рішеннями!",
            "Це хороша порада. Я спробую діяти без сумнівів.",
            "Але ж я завжди обдумую свої рішення. Чому це важливо?"
        ]
    },
    {
        "text_stage": "Підсумки енергії та ефективності",
        "text_coach": "Ти добре розподілив свою енергію під час тренування, але в кінці було видно втому.",
        "variable_answers": [
            "Я постараюсь краще зберігати сили для кінця тренування!",
            "Я помітив, що втомився, але це частина тренування.",
            "Можливо, мені потрібно краще тренувати витривалість."
        ]
    },
    {
        "text_stage": "Хвалебні слова про техніку",
        "text_coach": "Твоя техніка передач і ударів покращилась. Молодець!",
        "variable_answers": [
            "Дякую, тренере! Я працював над цим!",
            "Задоволений своїми результатами, але ще є куди рости.",
            "Це завдяки тренуванням! Але потрібно більше працювати."
        ]
    },
    {
        "text_stage": "Робота над слабкими місцями",
        "text_coach": "Ти, можливо, не зовсім добре працюєш в обороні. Ти маєш покращити свою позиційну гру.",
        "variable_answers": [
            "Зрозуміло, тренере! Я займуся цим!",
            "Я буду працювати над своїми помилками, це моя слабка сторона.",
            "Мені здається, що я добре захищався, але спробую ще."
        ]
    },
    {
        "text_stage": "Обговорення з командою",
        "text_coach": "Ми закінчили тренування. Зараз обговоримо загальні досягнення команди. Ти добре виглядав на полі!",
        "variable_answers": [
            "Я радий, що допоміг команді!",
            "Спільно ми сильніші. Разом досягнемо більше!",
            "Ми ще можемо багато чого покращити."
        ]
    },
    {
        "text_stage": "Мотиваційний завершальний спіч",
        "text_coach": "Ти показав чудові результати. Але пам'ятай, що це лише початок. Рухайся вперед!",
        "variable_answers": [
            "Я готовий працювати ще більше, тренере!",
            "Так, попереду ще багато роботи, але я вірю в себе.",
            "Це був важкий день. Я потребую відпочинку."
        ]
    },
    {
        "text_stage": "Привітання з досягненнями",
        "text_coach": "Сьогодні ти справжній лідер на полі. Я бачив, як ти працював над кожним аспектом.",
        "variable_answers": [
            "Я радий, що зміг допомогти команді!",
            "Це все завдяки командній роботі!",
            "Ми ще можемо покращити багато чого."
        ]
    },
    {
        "text_stage": "Завершення тренування із похвалою",
        "text_coach": "Це був хороший тренувальний день, ти справжній професіонал!",
        "variable_answers": [
            "Спасибі, тренере. Працюватиму ще краще!",
            "Це тільки початок. Я знаю, як удосконалюватися.",
            "Я трохи втомлений, але готовий рухатися вперед."
        ]
    },
    {
        "text_stage": "Нагадування про важливість наступних тренувань",
        "text_coach": "Чудово сьогодні! Пам'ятай, що нам ще багато потрібно вдосконалити.",
        "variable_answers": [
            "Чекаю на наступне тренування! Працюватиму над собою!",
            "Це був хороший тренувальний день. Готовий до нових досягнень.",
            "Здається, я потребую перерву перед наступним тренуванням."
        ]
    }
]
